app/controllers/companies_controller.rb

  def create
    @company = Company.new(company_params)

    respond_to do |format|
      if @company.save
---
INSERT INTO "companies" ("nome", "cnpj", "telefone", "email", "endereco", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def list
    @companies = Company.all
---
SELECT "companies".* FROM "companies"